Repository: Duan/Zoooday
Catalog: sites/all/modules/imagefield_import/translations/*.po
Languages: es

source: Images will be imported to the %field field on the %type content type.
es: Las imágenes se importarán en el campo %field del tipo de contenido %type.

source: A node will be created for each imported image.
es: Se creará un nodo para cada imagen importada.

source: All imported images will be added to a single node.
es: Todas las imágenes importadas se añadirán a un único nodo.

source: If any taxonomies are associated with the %type content type, you can use the form below to set taxonomy terms on all uploaded images.
es: Si alguna taxonomía esta asociada al tipo de contenido %type, puede utilizar el formulario inferior para asignar términos de taxonomía a las imágenes cargadas.

source: All non-filefield form widgets are rendered at the bottom of the form. Use them to set values on all imported nodes.
es: Todos los campos que no corresponden a ficheros se muestran al final del formulario. Utilícelos para asignar valores a los nodos importados.

source: Content types
es: Tipos de contenido

source: In order to import images into an imagefield, you must first have a node type that has an imagefield associated with it. Configure this on the !url page
es: Para importar imágenes en un campo de imagen, antes debe tener un tipo de contenido que tenga un campo de imagen asociado con él. Configúrelo en la página !url.

source: Import path
es: Ruta de importación

source: A file system path where files are stored before being imported. This directory must exist and be writable by Drupal. Paths with a leading slash (e.g. '/upload') are relative to the server's root directory while paths without a leading slash (e.g. 'upload') are relative to the Drupal root directory.
es: Una ruta del sistema de ficheros en la que se almacenan los archivos antes de ser importados. Este directorio debe existir y ser escribible por Drupal. Rutas con una barra inicial (p.e. '/upload') son relativas al directorio raíz del servidor, mientras que rutas sin una barra inicial (p.e. 'upload') son relativas al directorio raíz de Drupal.

source: Target field
es: Campo de destino

source: Select the imagefield you want to import photos into. When you do the import, nodes of your selected type will be created and the selected field will be populated with the imported image.
es: Seleccione el campo de imagen en el que quiere importar las fotografías. Cuando realice la importación, se crearán nodos del tipo seleccionado y el campo seleccionado se rellenará con la imagen importada.

source: Mode
es: Modo

source: Import images to separate nodes
es: Importar imágenes a nodos independientes

source: Import images to a single node
es: Importar imágenes a un único nodo

source: Choose import images to separate nodes if you want to create a node for each image you import. Choose import images to a single node to add all imported images to a single node which will be created during the import.
es: Seleccione importar imágenes a nodos independientes si desea crear un nodo para cada imagen que importe. Seleccione importar imágenes a un único nodo para añadir todas las imágenes importadas a un único nodo que se creará durante la importación.

source: Thumbnails
es: Miniaturas

source: Show thumbnails
es: Mostrar miniaturas

source: Show thumbnails on the import form. WARNING: This displays the original images scaled by the browser and will only work if the upload folder is placed below the Drupal root folder.
es: Mostrar miniaturas durante la importación. ATENCIÓN: Esta opción muestra las imágenes originales escaladas por el navegador y sólo funcionará si el directorio de carga esta situado bajo el directorio raíz de Drupal.

source: Thumbnail width
es: Anchura de las miniaturas

source: Enter the width of the thumbnails in pixels.
es: Introduzca la anchura de las miniaturas en píxeles.

source: File handling
es: Manejo de archivos

source: Ignore files
es: Ignorar archivos

source: Ignore any files matching this regular expression. You must include the leading and trailing slash of the regular expression. Leave the field empty if you do not want to ignore any files.
es: Ignorar cualquier archivo que coincida con esta expresión regular. Debe incluir la barra inicial y final de la expresión regular. Deje en blanco si no desea ignorar ningún archivo.

source: Delete files after import
es: Borrar archivos tras la importación

source: Delete the images from the upload folder when they have been succesfully imported.
es: Borrar las imágenes del directorio de carga después de que hayan sido importadas satisfactoriamente.

source: Publishing options
es: Opciones de publicación

source: Set node status during import
es: Establecer el estado del nodo durante la importación

source: Mark each imported node as published/unpublished when they are imported. All imported nodes are published by default.
es: Marcar cada nodo importado como publicado/no publicado cuando se importe. Todos los nodos importados son publicados por defecto.

source: Set default status to unpublished
es: Establecer el estado por defecto a no publicado

source: By default each imported node is marked as published. All files matching this regular expression will have the status dropdown set to unpublished on the import form. You must include the leading and trailing slash of the regular expression. Leave the field empty if you do not want to use this feature.
es: Por defecto, cada nodo importado es marcado como publicado. Todos los archivos que coincidan con esta expresión regular tendrán su estado establecido a no publicado en en formulario de importación. Debe incluir la barra inicial y final de la expresión regular. Deje en blanco si no desea utilizar estar funcionalidad.

source: Advanced settings
es: Ajustes avanzados.

source: Title and body fields
es: Campos de título y cuerpo

source: Prepopulate the title field with the name of the image file.
es: Rellenar el campo de título con el nombre del archivo de imagen.

source: Get from image EXIF data
es: Obtener de la información EXIF de la imagen

source: These settings are only relevant if you have selected %exif above.
es: Estos ajustes son sólo relevantes si has selecciona %exif anteriormente.

source: EXIF title
es: Título EXIF

source: Select the EXIF field you want to use to prepopulate the title field on the import form.
es: Seleccione el campo EXIF que desee usar para rellenar el campo título del formulario de importación.

source: EXIF body
es: Cuerpo EXIF

source: Select the EXIF field you want to use to prepopulate the body field on the import form.
es: Seleccione el campo EXIF que desee utilizar para rellenar el campo cuerpo del formulario de importación

source: Get from image IPTC data
es: Obtener de la información IPTC de la imagen

source: These settings are only relevant if you have selected %iptc above.
es: Estos ajustes son sólo relevantes si ha seleccionado %iptc anteriormente.

source: IPTC title
es: Título IPTC

source: Select the IPTC field you want to use to prepopulate the title field on the import form.
es: Seleccione el campo IPTC que desee utilizar para rellenar el campo título del formulario de importación.

source: IPTC body
es: Cuerpo IPTC

source: Select the IPTC field you want to use to prepopulate the body field on the import form.
es: Seleccione el campo IPTC que desee utilizar para rellenar el campo cuerpo del formulario de importación.

source: Display selection form
es: Mostrar el formulario de selección

source: Enable this option to display a form allowing you to choose which images to import. Disable this option if you want to import all images or if you are importing thousands of images. If you disable this option you will still be able to apply taxonomy terms and other information, but you will not be able to modify the title and body of each imported image node.
es: Active esta opción para mostrar un formulario permitiéndole seleccionar que imágenes importar. Desactive esta opción si desea importar todas las imágenes o si está importando miles de imágenes. Si desactiva esta opción, todavía será capaz de aplicar términos de taxonomía y otra información, pero no será capaz de de modificar el título o el cuerpo de cada nodo de imagen importado.

source: Body field widget type
es: Tipo de campo para el cuerpo

source: Select the widget you want to use to popuplate the body field of each imported image. Choose one of the textarea settings if you need to enter long descriptions of the imported images.
es: Seleccione el tipo de campo que desea utilizar para rellenar el campo cuerpo de cada imagen importada. Seleccione un ajuste de área de texto si necesita introducir descripciones largas en las imágenes importadas.

source: Textfield
es: Campo de texto

source: Textarea
es: Área de texto

source: Textarea, resizable
es: Área de texto, redimensionable

source: Imagefield import settings page
es: Página de configuración de la importación de campo de imagen

source: You need to configure the import directory on the !settings-url. If you don't have the proper permissions to do that, please contact the site administrator.
es: Necesita configurar el directorio de importación de imágenes en !settings-url. Si no tiene los permisos necesarios para ello, por favor, contacte con el administrador del sitio.

source: The upload directory %directory is empty.
es: El directorio de carga %directory está vacío.

source: Title
es: Título

source: Import
es: Importar

source: Published
es: Publicado

source: Unpublished
es: No publicado

source: All @count images in the import folder will be imported.
es: Todas las @count imágenes del directorio de importación se importarán.

source: You must enter a title for each image.
es: Debes introducir un título para cada imagen.

source: Import images page
es: Página de importación de imágenes.

source: No images have been selected for import. Please return to the !url.
es: No se han seleccionado imágenes para la importación. Por favor, regrese a !url.

source: Are you sure you want to import @count images?
es: ¿Está seguro que desea importar @count imágenes?

source: @count images will be imported from the folder %path. This action cannot be undone.
es: Se importarán @count imágenes del directorio %path. Esta acción no se puede deshacer.

source: Import images
es: Importar imágenes

source: Cancel
es: Cancelar

source: Importing images to a single node
es: Importar imágenes a un único nodo

source: Image import is starting.
es: La importación de imágenes ha comenzado.

source: Imported @current out of @total.
es: Importadas @current de @total

source: Image import has encountered an error.
es: La importación de imágenes ha encontrado un error.

source: Importing images to separate nodes
es: Importar imágenes a nodos independientes

source: @count images imported.
es: Se han importado @count imáges.

source: An error occurred while processing %error_operation with arguments: @arguments
es: Un error ha ocurrido mientras se procesaba %error_operation con los argumentos: @arguments

source: You can't import from the image module's directory. The import deletes the original files so you would just be asking for trouble.
es: No puede importar desde el directorio del módulo imagen. La importación borrará las imágenes originales, por lo que sólo está buscando problemas.

source: File
es: Archivo

source: Thumbnail
es: Miniatura

source: Status
es: Estado

source: Don't prepopulate
es: No rellenar

source: Use filename as title
es: Usar el nombre del archivo cómo título

source: Filename
es: Nombre del archivo

source: Unix timestamp
es: Marca de tiempo UNIX

source: File size
es: Tamaño del archivo

source: Mime type
es: Tipo MIME

source: Description
es: Descripción

source: Date and time
es: Fecha y hora

source: Artist
es: Artista

source: Object name
es: Nombre del objeto

source: Special instructions
es: Instrucciones especiales

source: Date created
es: Fecha de creación

source: Byline title
es: Título Byline

source: City
es: Ciudad

source: Province/state
es: Provincia/estado

source: Country/primary location name
es: País/nombre de la localización primaria

source: Original transmission reference
es: Referencia de la transmisión original

source: Headline
es: Titular

source: Credit
es: Crédito

source: Source
es: Origen

source: Copyright notice
es: Nota de copyright

source: Caption/abstract
es: Etiqueta/abstracto

source: WRITABLE
es: ESCRIBIBLE

source: NOT WRITABLE
es: NO ESCRIBIBLE

source: Click the checkboxes next to the images you want to import. You can add a title and a body to each image before you start the import.
es: Marque las casillas junto a las imágenes que desee importar. Puede añadir un título y un cuerpo a cada imagen antes de empezar la importación.
